<?php

$year = [];

for ($i = 2010; $i <= 2050; $i++) {
    $year[$i] = $i;
}

return [
    'year' => $year,

    'gubun' => [
        'N' => '일반회원',
        'S' => '특별회원',
        'G' => '단체회원',
    ],
    'category' => [
        'A' => '입회비',
        'B' => '연회비',
        'C' => '종신회비',
    ],
    'payment_method' => [
        'Card' => '신용카드',
        'DirectBank' => '실시간계좌이체',
//        'VBank' => '가상계좌',
    ],
    'payment_status' => [
        'Y' => '완납',
        'N' => '미납',
    ],

    'price' => [
        'N'/*일반회원*/ => [ //회원 등급
            'A' => 20000,
            'B' => 50000,
            'C' => 700000,
            'D' => 400000, //55세 이상은 400000 => JoinService,/admin/fee/upsert 에서 사용, 이외에 사용X
        ],
        'S'/*특별회원*/ => [
            'A' => [
                'B' => 500000,
            ],
            'B' => [
                'B' => 1000000,
            ],
            'C' => [
                'B' => 2000000,
            ]
        ],
        'G'/*그룹회원*/ => [
            'B' => 150000,
        ]
    ],

    'getCate' => [
        'N'/*일반회원*/ => [
            'A' => '입회비',
            'B' => '연회비',
            'C' => '종신회비',
        ],
        'S'/*특별회원*/ => [
            'B' => '연회비',
        ],
        'G'/*그룹회원*/ => [
            'B' => '연회비',
        ]
    ],
]
?>