<?php
return [

    'gubun' => [
        'N' => '일반회원',
        'S' => '특별회원',
        'G' => '단체회원'
    ],

    'grade' => [
        'N' => [
            'A' => '정회원',
            'B' => '종신회원'
        ],
        'S' => [
            'A' => '중소기업',
            'B' => '국가기관, 공기업(중견기업, 국가기관, 정부투자기관, 공기업)',
            'C' => '대기업'
        ]
    ],

    'level'/*구분용*/ => [
        'NA'=>'일반회원-정회원',
        'NB'=>'일반회원-종신회원',
        'SA'=>'특별회원-중소기업',
        'SB'=>'특별회원-국가기관,관공서',
        'SC'=>'특별회원-대기업',
        'G'=>'단체회원',
    ],

    'job' => [
        'A' => '대학',
        'B' => '연구소',
        'C' => '산업체',
        'D' => '기업연구소',
        'E' => '국가기관',
    ],

    'position' => [
        'A' => '학부생',
        'B' => '학부연구생',
        'C' => '석사과정',
        'D' => '박사과정',
        'E' => '석박사통합과정',
        'F' => '조교수',
        'G' => '부교수',
        'H' => '교수'
    ],

    'degree' => [
        'A' => '박사',
        'B' => '석사',
        'C' => '학사',
        'D' => '기타'
    ],

    'sex' => [
        'M' => '남자',
        'F' => '여자'
    ],

    'receptionYn' => [
        'Y' => '수신',
        'N' => '수신거부'
    ],

    'emailReception'/*어드민용*/ => [
        'Y' => '예',
        'N' => '아니오'
    ],

    'post' => [
        'H' => '자택',
        'O' => '직장',
        'N' => '수신거부'
    ],

    'payMethod' => [
        'CARD' => '신용카드',
        'EASYPAY' => '실시간계좌이체'
    ],

    'areaNumber' => [
        '02' => '02',
        '031' => '031',
        '032' => '032',
        '033' => '033',
        '041' => '041',
        '042' => '042',
        '043' => '043',
        '044' => '044',
        '051' => '051',
        '052' => '052',
        '053' => '053',
        '054' => '054',
        '055' => '055',
        '061' => '061',
        '062' => '062',
        '063' => '063',
        '064' => '064',
        '070' => '070',
        '0505' => '0505',
        '0502' => '0502'
    ],

    'popup-search-field' => [
        'name' => '이름',
        'id' => '아이디',
        'company' => '직장명(기관명)',
    ],
]
?>